Autodesk.Revit.DB.Visual.MetallicPaint.CommonTintColor
The property labeled "Tint Color" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.CommonTintToggle
The property labeled "Tint" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFinishPeelamount
The property labeled "Amount" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFinish
The property labeled "Finish" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintFinishType".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintTopcoatFalloff
The property labeled "Angle Falloff" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintTopcoatGlossy
The property labeled "Glossiness" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintTopcoat
The property labeled "Top Coat" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintTopcoatType".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearlIor
The property labeled "Blend" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearlColor
The property labeled "Color" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearlColorByObject
The property labeled "Color By Object" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearlAmount
The property labeled "Amount" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearl
The property labeled "Pearl" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintPearlType".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFlecksSize
The property labeled "Size" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFlecksColor
The property labeled "Color" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFlecksColorByObject
The property labeled "Color By Object" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFlecks
The property labeled "Flecks" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintFlecksType".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintBaseHighlightspread
The property labeled "Highlight Spread" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintBaseColorByObject
The property labeled "Color By Object" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintBaseColor
The property labeled "Color" from the "MetallicPaint" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.MetallicPaint
Represents the properties of materials.
Since:
2018.1